app/controllers/coaches_controller.rb

  def index
    @coaches = Coach.all
---
SELECT "coaches".* FROM "coaches"

  def create
    @coach = Coach.new(coach_params)

    respond_to do |format|
      if @coach.save
---
INSERT INTO "coaches" ("idcoaches", "coach_name", "coach_surname", "coach_nick", "coach_age", "teams_idteams", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def set_coach
    @coach = Coach.find(params[:id])
---
SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]