app/controllers/players_controller.rb

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("idplayers", "player_name", "player_surname", "player_nick", "player_age", "teams_idteams", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @player.destroy!
---
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 4]]