app/controllers/schedules_controller.rb

  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save
---
INSERT INTO "schedules" ("idmatches", "teams_idteams1", "teams_idteams2", "date", "tournament_place", "team1_points_earned", "teams2_points_earned", "tournaments_idtournaments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"