app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("idteams", "team_name", "team_location", "team_region", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["idteams", 1], ["team_name", "Liquid"], ["team_location", "Los Angeles"], ["team_region", "USA"], ["created_at", "2023-12-23 19:13:00.550350"], ["updated_at", "2023-12-23 19:13:00.550350"]]