app/controllers/tournaments_controller.rb

INSERT INTO "tournaments" ("idtournament", "tournament_name", "prizepool", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["idtournament", 1], ["tournament_name", "VCT"], ["prizepool", 100000], ["created_at", "2023-12-23 18:54:08.916932"], ["updated_at", "2023-12-23 18:54:08.916932"]]
---
  def create
    @tournament = Tournament.new(tournament_params)

    respond_to do |format|
      if @tournament.save

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_tournament
    @tournament = Tournament.find(params[:id])